{"class_name": "Sequential", "backend": "tensorflow", "config": {"layers": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dtype": "float32", "trainable": true, "data_format": "channels_last", "batch_input_shape": [null, 32, 32, 3], "kernel_size": [3, 3], "name": "conv2d_1", "padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "use_bias": true, "bias_regularizer": null, "filters": 32, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_2", "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "filters": 32, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_1", "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_3", "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "filters": 64, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_4", "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "filters": 64, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_2", "seed": null, "noise_shape": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activation": "linear", "name": "dense_1", "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "units": 512}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_3", "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activation": "softmax", "name": "dense_2", "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "units": 10}}], "name": "sequential_1"}, "keras_version": "2.2.4"}