{"config": {"layers": [{"config": {"batch_input_shape": [null, 32, 32, 3], "trainable": true, "name": "conv2d_1", "use_bias": true, "bias_regularizer": null, "dtype": "float32", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "activity_regularizer": null, "padding": "same", "filters": 32, "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "conv2d_2", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "filters": 32, "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_1", "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "trainable": true, "noise_shape": null, "rate": 0.25, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "conv2d_3", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "filters": 64, "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "conv2d_4", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "filters": 64, "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_2", "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "trainable": true, "noise_shape": null, "rate": 0.25, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dense_1", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 512, "activation": "linear", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "class_name": "Activation"}, {"config": {"seed": null, "trainable": true, "noise_shape": null, "rate": 0.5, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "dense_2", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 10, "activation": "softmax", "kernel_regularizer": null}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow"}